nhathoangbui123/electrical-monitoring-system-and-control-electrical-equipment/CODE STM32/STM32_PZEM/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BTN_GREEN_Pin GPIO_PIN_5
#define BTN_GREEN_GPIO_Port GPIOE
#define BTN_RED_Pin GPIO_PIN_6
#define BTN_RED_GPIO_Port GPIOE
#define LED_GREEN_Pin GPIO_PIN_13
#define LED_GREEN_GPIO_Port GPIOC
#define SPEAKER_Pin GPIO_PIN_14
#define SPEAKER_GPIO_Port GPIOC
#define CS_Pin GPIO_PIN_4
#define CS_GPIO_Port GPIOA
#define T_IRQ_Pin GPIO_PIN_8
#define T_IRQ_GPIO_Port GPIOE
#define T_CLK_Pin GPIO_PIN_9
#define T_CLK_GPIO_Port GPIOE
#define T_MISO_Pin GPIO_PIN_10
#define T_MISO_GPIO_Port GPIOE
#define T_MOSI_Pin GPIO_PIN_11
#define T_MOSI_GPIO_Port GPIOE
#define T_CS_Pin GPIO_PIN_12
#define T_CS_GPIO_Port GPIOE
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOE
#define DC_Pin GPIO_PIN_14
#define DC_GPIO_Port GPIOE
#define RST_Pin GPIO_PIN_15
#define RST_GPIO_Port GPIOE
#define KICH_Pin GPIO_PIN_8
#define KICH_GPIO_Port GPIOC
#define LED_RED_Pin GPIO_PIN_9
#define LED_RED_GPIO_Port GPIOC
#define DEVICE_1_Pin GPIO_PIN_12
#define DEVICE_1_GPIO_Port GPIOA
#define LED_YELLOW_Pin GPIO_PIN_12
#define LED_YELLOW_GPIO_Port GPIOC
#define DEVICE_2_Pin GPIO_PIN_2
#define DEVICE_2_GPIO_Port GPIOD
#define DEVICE_3_Pin GPIO_PIN_4
#define DEVICE_3_GPIO_Port GPIOB
#define ALL_DEVICE_Pin GPIO_PIN_5
#define ALL_DEVICE_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
